export const searchIndex = [
  {
    "title": "首页",
    "headers": [],
    "path": "/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "达芬奇 DaVinci Resolve",
    "headers": [
      {
        "level": 3,
        "title": "🎬达芬奇常用快捷键🚀",
        "slug": "🎬达芬奇常用快捷键🚀",
        "link": "#🎬达芬奇常用快捷键🚀",
        "children": []
      },
      {
        "level": 3,
        "title": "时间线设置",
        "slug": "时间线设置",
        "link": "#时间线设置",
        "children": []
      },
      {
        "level": 3,
        "title": "镜头防抖",
        "slug": "镜头防抖",
        "link": "#镜头防抖",
        "children": []
      },
      {
        "level": 3,
        "title": "声音调节",
        "slug": "声音调节",
        "link": "#声音调节",
        "children": []
      },
      {
        "level": 3,
        "title": "常用特效",
        "slug": "常用特效",
        "link": "#常用特效",
        "children": []
      },
      {
        "level": 3,
        "title": "磨皮参数",
        "slug": "磨皮参数",
        "link": "#磨皮参数",
        "children": []
      },
      {
        "level": 3,
        "title": "达芬奇导出设置",
        "slug": "达芬奇导出设置",
        "link": "#达芬奇导出设置",
        "children": []
      }
    ],
    "path": "/dfq/dfq20250123.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "集合",
    "headers": [
      {
        "level": 2,
        "title": "PR",
        "slug": "pr",
        "link": "#pr",
        "children": []
      },
      {
        "level": 2,
        "title": "PS",
        "slug": "ps",
        "link": "#ps",
        "children": []
      },
      {
        "level": 2,
        "title": "AU",
        "slug": "au",
        "link": "#au",
        "children": []
      },
      {
        "level": 2,
        "title": "达芬奇",
        "slug": "达芬奇",
        "link": "#达芬奇",
        "children": []
      }
    ],
    "path": "/PR/ALL.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "短剧",
    "headers": [
      {
        "level": 2,
        "title": "pr短剧",
        "slug": "pr短剧",
        "link": "#pr短剧",
        "children": [
          {
            "level": 3,
            "title": "男频",
            "slug": "男频",
            "link": "#男频",
            "children": []
          },
          {
            "level": 3,
            "title": "女频",
            "slug": "女频",
            "link": "#女频",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "如何配置音乐和音效",
        "slug": "如何配置音乐和音效",
        "link": "#如何配置音乐和音效",
        "children": []
      },
      {
        "level": 2,
        "title": "AU调整声音",
        "slug": "au调整声音",
        "link": "#au调整声音",
        "children": []
      },
      {
        "level": 2,
        "title": "iZotope RX 8 Audio Editor修改声音",
        "slug": "izotope-rx-8-audio-editor修改声音",
        "link": "#izotope-rx-8-audio-editor修改声音",
        "children": []
      },
      {
        "level": 2,
        "title": "达芬奇进行视频降噪",
        "slug": "达芬奇进行视频降噪",
        "link": "#达芬奇进行视频降噪",
        "children": []
      },
      {
        "level": 2,
        "title": "PR调色",
        "slug": "pr调色",
        "link": "#pr调色",
        "children": []
      }
    ],
    "path": "/PR/PR.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "BOOTSTRAP响应式",
    "headers": [
      {
        "level": 2,
        "title": "响应式",
        "slug": "响应式",
        "link": "#响应式",
        "children": [
          {
            "level": 3,
            "title": "1设备的宽度",
            "slug": "_1设备的宽度",
            "link": "#_1设备的宽度",
            "children": []
          },
          {
            "level": 3,
            "title": "2媒体查询规则",
            "slug": "_2媒体查询规则",
            "link": "#_2媒体查询规则",
            "children": []
          },
          {
            "level": 3,
            "title": "3响应式断点设计原则",
            "slug": "_3响应式断点设计原则",
            "link": "#_3响应式断点设计原则",
            "children": []
          },
          {
            "level": 3,
            "title": "4相对于视口的尺寸",
            "slug": "_4相对于视口的尺寸",
            "link": "#_4相对于视口的尺寸",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "Bootstrap",
        "slug": "bootstrap",
        "link": "#bootstrap",
        "children": [
          {
            "level": 3,
            "title": "1学习UI框架的终极意义",
            "slug": "_1学习ui框架的终极意义",
            "link": "#_1学习ui框架的终极意义",
            "children": []
          },
          {
            "level": 3,
            "title": "2Bootstrap文档",
            "slug": "_2bootstrap文档",
            "link": "#_2bootstrap文档",
            "children": []
          },
          {
            "level": 3,
            "title": "3模板文件",
            "slug": "_3模板文件",
            "link": "#_3模板文件",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "Bootstrap的响应式",
        "slug": "bootstrap的响应式",
        "link": "#bootstrap的响应式",
        "children": [
          {
            "level": 3,
            "title": "1断点breakpoints",
            "slug": "_1断点breakpoints",
            "link": "#_1断点breakpoints",
            "children": []
          },
          {
            "level": 3,
            "title": "2容器 container",
            "slug": "_2容器-container",
            "link": "#_2容器-container",
            "children": []
          },
          {
            "level": 3,
            "title": "3天沟 gutter",
            "slug": "_3天沟-gutter",
            "link": "#_3天沟-gutter",
            "children": []
          },
          {
            "level": 3,
            "title": "4颜色 color",
            "slug": "_4颜色-color",
            "link": "#_4颜色-color",
            "children": []
          },
          {
            "level": 3,
            "title": "5表格 table",
            "slug": "_5表格-table",
            "link": "#_5表格-table",
            "children": []
          },
          {
            "level": 3,
            "title": "6表单 form",
            "slug": "_6表单-form",
            "link": "#_6表单-form",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "工具类utilities",
        "slug": "工具类utilities",
        "link": "#工具类utilities",
        "children": [
          {
            "level": 3,
            "title": "1尺寸Sizing",
            "slug": "_1尺寸sizing",
            "link": "#_1尺寸sizing",
            "children": []
          },
          {
            "level": 3,
            "title": "2边框borders",
            "slug": "_2边框borders",
            "link": "#_2边框borders",
            "children": []
          },
          {
            "level": 3,
            "title": "3间距",
            "slug": "_3间距",
            "link": "#_3间距",
            "children": []
          },
          {
            "level": 3,
            "title": "4浮动",
            "slug": "_4浮动",
            "link": "#_4浮动",
            "children": []
          },
          {
            "level": 3,
            "title": "5定位",
            "slug": "_5定位",
            "link": "#_5定位",
            "children": []
          },
          {
            "level": 3,
            "title": "6display显示模式",
            "slug": "_6display显示模式",
            "link": "#_6display显示模式",
            "children": []
          },
          {
            "level": 3,
            "title": "7flex弹性布局",
            "slug": "_7flex弹性布局",
            "link": "#_7flex弹性布局",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "布局栅格系统 Grid",
        "slug": "布局栅格系统-grid",
        "link": "#布局栅格系统-grid",
        "children": [
          {
            "level": 3,
            "title": "1行和列",
            "slug": "_1行和列",
            "link": "#_1行和列",
            "children": []
          },
          {
            "level": 3,
            "title": "2响应式栅格布局",
            "slug": "_2响应式栅格布局",
            "link": "#_2响应式栅格布局",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "栅格布局",
        "slug": "栅格布局",
        "link": "#栅格布局",
        "children": [
          {
            "level": 3,
            "title": "1按钮组件",
            "slug": "_1按钮组件",
            "link": "#_1按钮组件",
            "children": []
          },
          {
            "level": 3,
            "title": "2Navbar导航栏",
            "slug": "_2navbar导航栏",
            "link": "#_2navbar导航栏",
            "children": []
          },
          {
            "level": 3,
            "title": "3徽章 badge",
            "slug": "_3徽章-badge",
            "link": "#_3徽章-badge",
            "children": []
          },
          {
            "level": 3,
            "title": "4图标 icons",
            "slug": "_4图标-icons",
            "link": "#_4图标-icons",
            "children": []
          },
          {
            "level": 3,
            "title": "5下拉菜单Dropdowns",
            "slug": "_5下拉菜单dropdowns",
            "link": "#_5下拉菜单dropdowns",
            "children": []
          },
          {
            "level": 3,
            "title": "6模态框 Modal",
            "slug": "_6模态框-modal",
            "link": "#_6模态框-modal",
            "children": []
          },
          {
            "level": 3,
            "title": "7手风琴 accordion",
            "slug": "_7手风琴-accordion",
            "link": "#_7手风琴-accordion",
            "children": []
          },
          {
            "level": 3,
            "title": "8列表组listgroup",
            "slug": "_8列表组listgroup",
            "link": "#_8列表组listgroup",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "轮播图Carousel",
        "slug": "轮播图carousel",
        "link": "#轮播图carousel",
        "children": []
      }
    ],
    "path": "/WEB/BOOTSTRAP.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "CSS",
    "headers": [
      {
        "level": 2,
        "title": "CSS概述",
        "slug": "css概述",
        "link": "#css概述",
        "children": []
      },
      {
        "level": 2,
        "title": "CSS编写的不同位置",
        "slug": "css编写的不同位置",
        "link": "#css编写的不同位置",
        "children": [
          {
            "level": 3,
            "title": "1行内样式 inline style",
            "slug": "_1行内样式-inline-style",
            "link": "#_1行内样式-inline-style",
            "children": []
          },
          {
            "level": 3,
            "title": "2内部样式 inner style",
            "slug": "_2内部样式-inner-style",
            "link": "#_2内部样式-inner-style",
            "children": []
          },
          {
            "level": 3,
            "title": "3外部样式 outer style",
            "slug": "_3外部样式-outer-style",
            "link": "#_3外部样式-outer-style",
            "children": []
          },
          {
            "level": 3,
            "title": "4三种样式的比较",
            "slug": "_4三种样式的比较",
            "link": "#_4三种样式的比较",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "选择器",
        "slug": "选择器",
        "link": "#选择器",
        "children": [
          {
            "level": 3,
            "title": "1通用选择器",
            "slug": "_1通用选择器",
            "link": "#_1通用选择器",
            "children": []
          },
          {
            "level": 3,
            "title": "2标签选择器",
            "slug": "_2标签选择器",
            "link": "#_2标签选择器",
            "children": []
          },
          {
            "level": 3,
            "title": "3ID选择器（为元素设定样式时推荐少用）",
            "slug": "_3id选择器-为元素设定样式时推荐少用",
            "link": "#_3id选择器-为元素设定样式时推荐少用",
            "children": []
          },
          {
            "level": 3,
            "title": "4类选择器",
            "slug": "_4类选择器",
            "link": "#_4类选择器",
            "children": []
          },
          {
            "level": 3,
            "title": "5群组选择器",
            "slug": "_5群组选择器",
            "link": "#_5群组选择器",
            "children": []
          },
          {
            "level": 3,
            "title": "6伪类选择器",
            "slug": "_6伪类选择器",
            "link": "#_6伪类选择器",
            "children": []
          },
          {
            "level": 3,
            "title": "拓展",
            "slug": "拓展",
            "link": "#拓展",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "CSS优先级",
        "slug": "css优先级",
        "link": "#css优先级",
        "children": [
          {
            "level": 3,
            "title": "1不同选择器不同样式",
            "slug": "_1不同选择器不同样式",
            "link": "#_1不同选择器不同样式",
            "children": []
          },
          {
            "level": 3,
            "title": "2相同选择器相同样式",
            "slug": "_2相同选择器相同样式",
            "link": "#_2相同选择器相同样式",
            "children": []
          },
          {
            "level": 3,
            "title": "3最近的祖先样式要比其他祖先样式优先级高",
            "slug": "_3最近的祖先样式要比其他祖先样式优先级高",
            "link": "#_3最近的祖先样式要比其他祖先样式优先级高",
            "children": []
          },
          {
            "level": 3,
            "title": "4指定样式大于继承样式",
            "slug": "_4指定样式大于继承样式",
            "link": "#_4指定样式大于继承样式",
            "children": []
          },
          {
            "level": 3,
            "title": "5选择器不同的权值",
            "slug": "_5选择器不同的权值",
            "link": "#_5选择器不同的权值",
            "children": []
          },
          {
            "level": 3,
            "title": "6原则",
            "slug": "_6原则",
            "link": "#_6原则",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "选择器",
        "slug": "选择器-1",
        "link": "#选择器-1",
        "children": [
          {
            "level": 3,
            "title": "1并列选择器",
            "slug": "_1并列选择器",
            "link": "#_1并列选择器",
            "children": []
          },
          {
            "level": 3,
            "title": "2后代(包含)选择器",
            "slug": "_2后代-包含-选择器",
            "link": "#_2后代-包含-选择器",
            "children": []
          },
          {
            "level": 3,
            "title": "3直接子代选择器",
            "slug": "_3直接子代选择器",
            "link": "#_3直接子代选择器",
            "children": []
          },
          {
            "level": 3,
            "title": "4兄弟选择器",
            "slug": "_4兄弟选择器",
            "link": "#_4兄弟选择器",
            "children": []
          },
          {
            "level": 3,
            "title": "5相邻兄弟选择器",
            "slug": "_5相邻兄弟选择器",
            "link": "#_5相邻兄弟选择器",
            "children": []
          },
          {
            "level": 3,
            "title": "6伪元素",
            "slug": "_6伪元素",
            "link": "#_6伪元素",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "CSS中的值",
        "slug": "css中的值",
        "link": "#css中的值",
        "children": [
          {
            "level": 3,
            "title": "1CSS中的色值",
            "slug": "_1css中的色值",
            "link": "#_1css中的色值",
            "children": []
          },
          {
            "level": 3,
            "title": "2CSS中的尺寸",
            "slug": "_2css中的尺寸",
            "link": "#_2css中的尺寸",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "页面元素的显示模式",
        "slug": "页面元素的显示模式",
        "link": "#页面元素的显示模式",
        "children": []
      },
      {
        "level": 2,
        "title": "流与文档流",
        "slug": "流与文档流",
        "link": "#流与文档流",
        "children": []
      },
      {
        "level": 2,
        "title": "CSS盒子模型(Box Model)",
        "slug": "css盒子模型-box-model",
        "link": "#css盒子模型-box-model",
        "children": [
          {
            "level": 3,
            "title": "1默认的盒子模型",
            "slug": "_1默认的盒子模型",
            "link": "#_1默认的盒子模型",
            "children": []
          },
          {
            "level": 3,
            "title": "2边框盒子模型(怪异盒子)",
            "slug": "_2边框盒子模型-怪异盒子",
            "link": "#_2边框盒子模型-怪异盒子",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "边框",
        "slug": "边框",
        "link": "#边框",
        "children": [
          {
            "level": 3,
            "title": "1边框的不同写法",
            "slug": "_1边框的不同写法",
            "link": "#_1边框的不同写法",
            "children": []
          },
          {
            "level": 3,
            "title": "边框的巧妙用法",
            "slug": "边框的巧妙用法",
            "link": "#边框的巧妙用法",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "内间距",
        "slug": "内间距",
        "link": "#内间距",
        "children": [
          {
            "level": 3,
            "title": "1四个方向的内间距",
            "slug": "_1四个方向的内间距",
            "link": "#_1四个方向的内间距",
            "children": []
          },
          {
            "level": 3,
            "title": "2内间距的简写形式",
            "slug": "_2内间距的简写形式",
            "link": "#_2内间距的简写形式",
            "children": []
          },
          {
            "level": 3,
            "title": "3不同显示模式下的内间距",
            "slug": "_3不同显示模式下的内间距",
            "link": "#_3不同显示模式下的内间距",
            "children": []
          },
          {
            "level": 3,
            "title": "4使用场景",
            "slug": "_4使用场景",
            "link": "#_4使用场景",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "外间距",
        "slug": "外间距",
        "link": "#外间距",
        "children": [
          {
            "level": 3,
            "title": "1四个方向的外间距",
            "slug": "_1四个方向的外间距",
            "link": "#_1四个方向的外间距",
            "children": []
          },
          {
            "level": 3,
            "title": "2外间距的简写形式",
            "slug": "_2外间距的简写形式",
            "link": "#_2外间距的简写形式",
            "children": []
          },
          {
            "level": 3,
            "title": "3外间距的特点",
            "slug": "_3外间距的特点",
            "link": "#_3外间距的特点",
            "children": []
          },
          {
            "level": 3,
            "title": "4外间距的取值",
            "slug": "_4外间距的取值",
            "link": "#_4外间距的取值",
            "children": []
          },
          {
            "level": 3,
            "title": "5外间距的重叠【重难点】",
            "slug": "_5外间距的重叠【重难点】",
            "link": "#_5外间距的重叠【重难点】",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "背景颜色和背景图片",
        "slug": "背景颜色和背景图片",
        "link": "#背景颜色和背景图片",
        "children": [
          {
            "level": 3,
            "title": "1背景颜色",
            "slug": "_1背景颜色",
            "link": "#_1背景颜色",
            "children": []
          },
          {
            "level": 3,
            "title": "2背景图片的插入",
            "slug": "_2背景图片的插入",
            "link": "#_2背景图片的插入",
            "children": []
          },
          {
            "level": 3,
            "title": "3背景图的重复(平铺)",
            "slug": "_3背景图的重复-平铺",
            "link": "#_3背景图的重复-平铺",
            "children": []
          },
          {
            "level": 3,
            "title": "4背景图定位",
            "slug": "_4背景图定位",
            "link": "#_4背景图定位",
            "children": []
          },
          {
            "level": 3,
            "title": "5精灵图",
            "slug": "_5精灵图",
            "link": "#_5精灵图",
            "children": []
          },
          {
            "level": 3,
            "title": "6背景渐变",
            "slug": "_6背景渐变",
            "link": "#_6背景渐变",
            "children": []
          },
          {
            "level": 3,
            "title": "7背景图的尺寸",
            "slug": "_7背景图的尺寸",
            "link": "#_7背景图的尺寸",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "版心",
        "slug": "版心",
        "link": "#版心",
        "children": []
      },
      {
        "level": 2,
        "title": "元素的隐藏与显示",
        "slug": "元素的隐藏与显示",
        "link": "#元素的隐藏与显示",
        "children": []
      },
      {
        "level": 2,
        "title": "元素浮动",
        "slug": "元素浮动",
        "link": "#元素浮动",
        "children": [
          {
            "level": 3,
            "title": "1为什么要用浮动",
            "slug": "_1为什么要用浮动",
            "link": "#_1为什么要用浮动",
            "children": []
          },
          {
            "level": 3,
            "title": "2float属性",
            "slug": "_2float属性",
            "link": "#_2float属性",
            "children": []
          },
          {
            "level": 3,
            "title": "3元素浮动后产生的效果",
            "slug": "_3元素浮动后产生的效果",
            "link": "#_3元素浮动后产生的效果",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "解决高度坍塌",
        "slug": "解决高度坍塌",
        "link": "#解决高度坍塌",
        "children": [
          {
            "level": 3,
            "title": "1父元素自定义高度",
            "slug": "_1父元素自定义高度",
            "link": "#_1父元素自定义高度",
            "children": []
          },
          {
            "level": 3,
            "title": "2给父元素设置BFC保护",
            "slug": "_2给父元素设置bfc保护",
            "link": "#_2给父元素设置bfc保护",
            "children": []
          },
          {
            "level": 3,
            "title": "3父级元素称为同层元素",
            "slug": "_3父级元素称为同层元素",
            "link": "#_3父级元素称为同层元素",
            "children": []
          },
          {
            "level": 3,
            "title": "4clear属性清除浮动影响",
            "slug": "_4clear属性清除浮动影响",
            "link": "#_4clear属性清除浮动影响",
            "children": []
          },
          {
            "level": 3,
            "title": "5使用伪元素",
            "slug": "_5使用伪元素",
            "link": "#_5使用伪元素",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "拓展",
        "slug": "拓展-1",
        "link": "#拓展-1",
        "children": [
          {
            "level": 3,
            "title": "1幽灵空白节点",
            "slug": "_1幽灵空白节点",
            "link": "#_1幽灵空白节点",
            "children": []
          },
          {
            "level": 3,
            "title": "2BFC",
            "slug": "_2bfc",
            "link": "#_2bfc",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "元素的美化和修饰",
        "slug": "元素的美化和修饰",
        "link": "#元素的美化和修饰",
        "children": [
          {
            "level": 3,
            "title": "1边框圆角的问题",
            "slug": "_1边框圆角的问题",
            "link": "#_1边框圆角的问题",
            "children": []
          },
          {
            "level": 3,
            "title": "2元素的阴影效果",
            "slug": "_2元素的阴影效果",
            "link": "#_2元素的阴影效果",
            "children": []
          },
          {
            "level": 3,
            "title": "3常见的光标样式",
            "slug": "_3常见的光标样式",
            "link": "#_3常见的光标样式",
            "children": []
          },
          {
            "level": 3,
            "title": "4小技巧汇总",
            "slug": "_4小技巧汇总",
            "link": "#_4小技巧汇总",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "文本处理",
        "slug": "文本处理",
        "link": "#文本处理",
        "children": [
          {
            "level": 3,
            "title": "1字号(字体大小)",
            "slug": "_1字号-字体大小",
            "link": "#_1字号-字体大小",
            "children": []
          },
          {
            "level": 3,
            "title": "2字体颜色",
            "slug": "_2字体颜色",
            "link": "#_2字体颜色",
            "children": []
          },
          {
            "level": 3,
            "title": "3文本的修饰线",
            "slug": "_3文本的修饰线",
            "link": "#_3文本的修饰线",
            "children": []
          },
          {
            "level": 3,
            "title": "4文本的水平对齐方式",
            "slug": "_4文本的水平对齐方式",
            "link": "#_4文本的水平对齐方式",
            "children": []
          },
          {
            "level": 3,
            "title": "5行高",
            "slug": "_5行高",
            "link": "#_5行高",
            "children": []
          },
          {
            "level": 3,
            "title": "6垂直对齐方式",
            "slug": "_6垂直对齐方式",
            "link": "#_6垂直对齐方式",
            "children": []
          },
          {
            "level": 3,
            "title": "7字体型号(家族)",
            "slug": "_7字体型号-家族",
            "link": "#_7字体型号-家族",
            "children": []
          },
          {
            "level": 3,
            "title": "8字体字重",
            "slug": "_8字体字重",
            "link": "#_8字体字重",
            "children": []
          },
          {
            "level": 3,
            "title": "9文本溢出效果",
            "slug": "_9文本溢出效果",
            "link": "#_9文本溢出效果",
            "children": []
          },
          {
            "level": 3,
            "title": "10首行缩进",
            "slug": "_10首行缩进",
            "link": "#_10首行缩进",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "元素的定位",
        "slug": "元素的定位",
        "link": "#元素的定位",
        "children": [
          {
            "level": 3,
            "title": "1定位的相关属性",
            "slug": "_1定位的相关属性",
            "link": "#_1定位的相关属性",
            "children": []
          },
          {
            "level": 3,
            "title": "2相对定位",
            "slug": "_2相对定位",
            "link": "#_2相对定位",
            "children": []
          },
          {
            "level": 3,
            "title": "3绝对定位",
            "slug": "_3绝对定位",
            "link": "#_3绝对定位",
            "children": []
          },
          {
            "level": 3,
            "title": "4固定定位",
            "slug": "_4固定定位",
            "link": "#_4固定定位",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "CSS高级选择器",
        "slug": "css高级选择器",
        "link": "#css高级选择器",
        "children": [
          {
            "level": 3,
            "title": "1结构性伪类选择器",
            "slug": "_1结构性伪类选择器",
            "link": "#_1结构性伪类选择器",
            "children": []
          },
          {
            "level": 3,
            "title": "2属性选择器",
            "slug": "_2属性选择器",
            "link": "#_2属性选择器",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "Flex弹性布局",
        "slug": "flex弹性布局",
        "link": "#flex弹性布局",
        "children": [
          {
            "level": 3,
            "title": "1flex简述",
            "slug": "_1flex简述",
            "link": "#_1flex简述",
            "children": []
          },
          {
            "level": 3,
            "title": "2flexbox弹性盒的指定",
            "slug": "_2flexbox弹性盒的指定",
            "link": "#_2flexbox弹性盒的指定",
            "children": []
          },
          {
            "level": 3,
            "title": "3容器和项目",
            "slug": "_3容器和项目",
            "link": "#_3容器和项目",
            "children": []
          },
          {
            "level": 3,
            "title": "4Flex的注意事项",
            "slug": "_4flex的注意事项",
            "link": "#_4flex的注意事项",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "flex容器属性",
        "slug": "flex容器属性",
        "link": "#flex容器属性",
        "children": [
          {
            "level": 3,
            "title": "1主轴的排列方向",
            "slug": "_1主轴的排列方向",
            "link": "#_1主轴的排列方向",
            "children": []
          },
          {
            "level": 3,
            "title": "2项目的换行",
            "slug": "_2项目的换行",
            "link": "#_2项目的换行",
            "children": []
          },
          {
            "level": 3,
            "title": "3主轴的排列方式与换行的简写",
            "slug": "_3主轴的排列方式与换行的简写",
            "link": "#_3主轴的排列方式与换行的简写",
            "children": []
          },
          {
            "level": 3,
            "title": "4主轴和交叉轴",
            "slug": "_4主轴和交叉轴",
            "link": "#_4主轴和交叉轴",
            "children": []
          },
          {
            "level": 3,
            "title": "5主轴上的项目对齐方式",
            "slug": "_5主轴上的项目对齐方式",
            "link": "#_5主轴上的项目对齐方式",
            "children": []
          },
          {
            "level": 3,
            "title": "6单行项目在交叉轴方向上的对齐方式",
            "slug": "_6单行项目在交叉轴方向上的对齐方式",
            "link": "#_6单行项目在交叉轴方向上的对齐方式",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "项目属性",
        "slug": "项目属性",
        "link": "#项目属性",
        "children": [
          {
            "level": 3,
            "title": "1项目的增长规则",
            "slug": "_1项目的增长规则",
            "link": "#_1项目的增长规则",
            "children": []
          },
          {
            "level": 3,
            "title": "2项目的收缩规则",
            "slug": "_2项目的收缩规则",
            "link": "#_2项目的收缩规则",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "CSS样式重置",
        "slug": "css样式重置",
        "link": "#css样式重置",
        "children": []
      },
      {
        "level": 2,
        "title": "过渡 transition",
        "slug": "过渡-transition",
        "link": "#过渡-transition",
        "children": [
          {
            "level": 3,
            "title": "1过渡的概念",
            "slug": "_1过渡的概念",
            "link": "#_1过渡的概念",
            "children": []
          },
          {
            "level": 3,
            "title": "2过渡属性是由以下四个分属性组合的",
            "slug": "_2过渡属性是由以下四个分属性组合的",
            "link": "#_2过渡属性是由以下四个分属性组合的",
            "children": []
          },
          {
            "level": 3,
            "title": "3过渡的简写",
            "slug": "_3过渡的简写",
            "link": "#_3过渡的简写",
            "children": []
          },
          {
            "level": 3,
            "title": "4多组过渡的写法",
            "slug": "_4多组过渡的写法",
            "link": "#_4多组过渡的写法",
            "children": []
          },
          {
            "level": 3,
            "title": "5常用的可过渡属性",
            "slug": "_5常用的可过渡属性",
            "link": "#_5常用的可过渡属性",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "变换 transform",
        "slug": "变换-transform",
        "link": "#变换-transform",
        "children": [
          {
            "level": 3,
            "title": "1位移函数 translate",
            "slug": "_1位移函数-translate",
            "link": "#_1位移函数-translate",
            "children": []
          },
          {
            "level": 3,
            "title": "2旋转函数 rotate",
            "slug": "_2旋转函数-rotate",
            "link": "#_2旋转函数-rotate",
            "children": []
          },
          {
            "level": 3,
            "title": "3缩放函数 scale",
            "slug": "_3缩放函数-scale",
            "link": "#_3缩放函数-scale",
            "children": []
          },
          {
            "level": 3,
            "title": "4扭曲函数 skew 【较少使用】",
            "slug": "_4扭曲函数-skew-【较少使用】",
            "link": "#_4扭曲函数-skew-【较少使用】",
            "children": []
          },
          {
            "level": 3,
            "title": "5多个函数一起使用",
            "slug": "_5多个函数一起使用",
            "link": "#_5多个函数一起使用",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "变换",
        "slug": "变换",
        "link": "#变换",
        "children": [
          {
            "level": 3,
            "title": "1修改基点",
            "slug": "_1修改基点",
            "link": "#_1修改基点",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "动画",
        "slug": "动画",
        "link": "#动画",
        "children": [
          {
            "level": 3,
            "title": "1关键帧的语法规则",
            "slug": "_1关键帧的语法规则",
            "link": "#_1关键帧的语法规则",
            "children": []
          },
          {
            "level": 3,
            "title": "2使用动画脚本(最简写法)",
            "slug": "_2使用动画脚本-最简写法",
            "link": "#_2使用动画脚本-最简写法",
            "children": []
          },
          {
            "level": 3,
            "title": "3Animation动画属性的拆分",
            "slug": "_3animation动画属性的拆分",
            "link": "#_3animation动画属性的拆分",
            "children": []
          }
        ]
      }
    ],
    "path": "/WEB/CSS.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "HTML基础",
    "headers": [
      {
        "level": 2,
        "title": "HTML入门",
        "slug": "html入门",
        "link": "#html入门",
        "children": [
          {
            "level": 3,
            "title": "1网页的组成",
            "slug": "_1网页的组成",
            "link": "#_1网页的组成",
            "children": []
          },
          {
            "level": 3,
            "title": "2HTML的定义",
            "slug": "_2html的定义",
            "link": "#_2html的定义",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "HTML的语法规则",
        "slug": "html的语法规则",
        "link": "#html的语法规则",
        "children": [
          {
            "level": 3,
            "title": "1HTML的特点",
            "slug": "_1html的特点",
            "link": "#_1html的特点",
            "children": []
          },
          {
            "level": 3,
            "title": "2语法基础",
            "slug": "_2语法基础",
            "link": "#_2语法基础",
            "children": []
          },
          {
            "level": 3,
            "title": "3完整的HTML结构",
            "slug": "_3完整的html结构",
            "link": "#_3完整的html结构",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "HTML标签",
        "slug": "html标签",
        "link": "#html标签",
        "children": [
          {
            "level": 3,
            "title": "1文本样式的标签",
            "slug": "_1文本样式的标签",
            "link": "#_1文本样式的标签",
            "children": []
          },
          {
            "level": 3,
            "title": "2换行标签",
            "slug": "_2换行标签",
            "link": "#_2换行标签",
            "children": []
          },
          {
            "level": 3,
            "title": "3注释",
            "slug": "_3注释",
            "link": "#_3注释",
            "children": []
          },
          {
            "level": 3,
            "title": "4转义符号",
            "slug": "_4转义符号",
            "link": "#_4转义符号",
            "children": []
          },
          {
            "level": 3,
            "title": "5段落标签",
            "slug": "_5段落标签",
            "link": "#_5段落标签",
            "children": []
          },
          {
            "level": 3,
            "title": "6标题字标签",
            "slug": "_6标题字标签",
            "link": "#_6标题字标签",
            "children": []
          },
          {
            "level": 3,
            "title": "7水平分割线标签",
            "slug": "_7水平分割线标签",
            "link": "#_7水平分割线标签",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "图片",
        "slug": "图片",
        "link": "#图片",
        "children": [
          {
            "level": 3,
            "title": "1图片",
            "slug": "_1图片",
            "link": "#_1图片",
            "children": []
          },
          {
            "level": 3,
            "title": "2url",
            "slug": "_2url",
            "link": "#_2url",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "超链接",
        "slug": "超链接",
        "link": "#超链接",
        "children": []
      },
      {
        "level": 2,
        "title": "表格",
        "slug": "表格",
        "link": "#表格",
        "children": [
          {
            "level": 3,
            "title": "1表格的语法",
            "slug": "_1表格的语法",
            "link": "#_1表格的语法",
            "children": []
          },
          {
            "level": 3,
            "title": "2表格的可选标记",
            "slug": "_2表格的可选标记",
            "link": "#_2表格的可选标记",
            "children": []
          },
          {
            "level": 3,
            "title": "3表格的属性",
            "slug": "_3表格的属性",
            "link": "#_3表格的属性",
            "children": []
          },
          {
            "level": 3,
            "title": "4不规则的表格",
            "slug": "_4不规则的表格",
            "link": "#_4不规则的表格",
            "children": []
          },
          {
            "level": 3,
            "title": "5表格的大小",
            "slug": "_5表格的大小",
            "link": "#_5表格的大小",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "列表",
        "slug": "列表",
        "link": "#列表",
        "children": [
          {
            "level": 3,
            "title": "1有序列表",
            "slug": "_1有序列表",
            "link": "#_1有序列表",
            "children": []
          },
          {
            "level": 3,
            "title": "2无序列表",
            "slug": "_2无序列表",
            "link": "#_2无序列表",
            "children": []
          },
          {
            "level": 3,
            "title": "列表的嵌套",
            "slug": "列表的嵌套",
            "link": "#列表的嵌套",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "表单",
        "slug": "表单",
        "link": "#表单",
        "children": [
          {
            "level": 3,
            "title": "1特点",
            "slug": "_1特点",
            "link": "#_1特点",
            "children": []
          },
          {
            "level": 3,
            "title": "2语法",
            "slug": "_2语法",
            "link": "#_2语法",
            "children": []
          },
          {
            "level": 3,
            "title": "3input元素",
            "slug": "_3input元素",
            "link": "#_3input元素",
            "children": []
          },
          {
            "level": 3,
            "title": "h5新增的input控件",
            "slug": "h5新增的input控件",
            "link": "#h5新增的input控件",
            "children": []
          },
          {
            "level": 3,
            "title": "select下拉选择框",
            "slug": "select下拉选择框",
            "link": "#select下拉选择框",
            "children": []
          },
          {
            "level": 3,
            "title": "textarea多行文本域",
            "slug": "textarea多行文本域",
            "link": "#textarea多行文本域",
            "children": []
          },
          {
            "level": 3,
            "title": "label关联控件",
            "slug": "label关联控件",
            "link": "#label关联控件",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "浮动框架",
        "slug": "浮动框架",
        "link": "#浮动框架",
        "children": [
          {
            "level": 3,
            "title": "结构化标签",
            "slug": "结构化标签",
            "link": "#结构化标签",
            "children": []
          }
        ]
      }
    ],
    "path": "/WEB/HTML.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "JAVASCRIPT",
    "headers": [
      {
        "level": 2,
        "title": "JS入门",
        "slug": "js入门",
        "link": "#js入门",
        "children": [
          {
            "level": 3,
            "title": "1JS的运行方式",
            "slug": "_1js的运行方式",
            "link": "#_1js的运行方式",
            "children": []
          },
          {
            "level": 3,
            "title": "2JS的语法规范",
            "slug": "_2js的语法规范",
            "link": "#_2js的语法规范",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "JS基础语法",
        "slug": "js基础语法",
        "link": "#js基础语法",
        "children": [
          {
            "level": 3,
            "title": "1注释",
            "slug": "_1注释",
            "link": "#_1注释",
            "children": []
          },
          {
            "level": 3,
            "title": "2变量",
            "slug": "_2变量",
            "link": "#_2变量",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "常量",
        "slug": "常量",
        "link": "#常量",
        "children": []
      },
      {
        "level": 2,
        "title": "数据类型",
        "slug": "数据类型",
        "link": "#数据类型",
        "children": [
          {
            "level": 3,
            "title": "1数值型",
            "slug": "_1数值型",
            "link": "#_1数值型",
            "children": []
          },
          {
            "level": 3,
            "title": "2字符串型",
            "slug": "_2字符串型",
            "link": "#_2字符串型",
            "children": []
          },
          {
            "level": 3,
            "title": "3布尔型",
            "slug": "_3布尔型",
            "link": "#_3布尔型",
            "children": []
          },
          {
            "level": 3,
            "title": "4未定义型",
            "slug": "_4未定义型",
            "link": "#_4未定义型",
            "children": []
          },
          {
            "level": 3,
            "title": "5空",
            "slug": "_5空",
            "link": "#_5空",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "数据类型的转换",
        "slug": "数据类型的转换",
        "link": "#数据类型的转换",
        "children": [
          {
            "level": 3,
            "title": "1隐式转换",
            "slug": "_1隐式转换",
            "link": "#_1隐式转换",
            "children": []
          },
          {
            "level": 3,
            "title": "2强制转换",
            "slug": "_2强制转换",
            "link": "#_2强制转换",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "运算符",
        "slug": "运算符",
        "link": "#运算符",
        "children": [
          {
            "level": 3,
            "title": "1算术运算符",
            "slug": "_1算术运算符",
            "link": "#_1算术运算符",
            "children": []
          },
          {
            "level": 3,
            "title": "2比较运算符",
            "slug": "_2比较运算符",
            "link": "#_2比较运算符",
            "children": []
          },
          {
            "level": 3,
            "title": "3逻辑运算符",
            "slug": "_3逻辑运算符",
            "link": "#_3逻辑运算符",
            "children": []
          },
          {
            "level": 3,
            "title": "4赋值运算符",
            "slug": "_4赋值运算符",
            "link": "#_4赋值运算符",
            "children": []
          },
          {
            "level": 3,
            "title": "5三目(元)运算符",
            "slug": "_5三目-元-运算符",
            "link": "#_5三目-元-运算符",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "操作网页元素的步骤",
        "slug": "操作网页元素的步骤",
        "link": "#操作网页元素的步骤",
        "children": [
          {
            "level": 3,
            "title": "1查找网页元素",
            "slug": "_1查找网页元素",
            "link": "#_1查找网页元素",
            "children": []
          },
          {
            "level": 3,
            "title": "2给按钮绑定事件，监听用户操作",
            "slug": "_2给按钮绑定事件-监听用户操作",
            "link": "#_2给按钮绑定事件-监听用户操作",
            "children": []
          },
          {
            "level": 3,
            "title": "3弹出警示框",
            "slug": "_3弹出警示框",
            "link": "#_3弹出警示框",
            "children": []
          },
          {
            "level": 3,
            "title": "4修改标签之间的内容(修改HTML)",
            "slug": "_4修改标签之间的内容-修改html",
            "link": "#_4修改标签之间的内容-修改html",
            "children": []
          },
          {
            "level": 3,
            "title": "5修改标签的CSS样式",
            "slug": "_5修改标签的css样式",
            "link": "#_5修改标签的css样式",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "流程控制",
        "slug": "流程控制",
        "link": "#流程控制",
        "children": [
          {
            "level": 3,
            "title": "分支结构",
            "slug": "分支结构",
            "link": "#分支结构",
            "children": []
          },
          {
            "level": 3,
            "title": "4switch-case语句",
            "slug": "_4switch-case语句",
            "link": "#_4switch-case语句",
            "children": []
          },
          {
            "level": 3,
            "title": "循环结构",
            "slug": "循环结构",
            "link": "#循环结构",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "函数【重点】",
        "slug": "函数【重点】",
        "link": "#函数【重点】",
        "children": [
          {
            "level": 3,
            "title": "1创建自定义函数",
            "slug": "_1创建自定义函数",
            "link": "#_1创建自定义函数",
            "children": []
          },
          {
            "level": 3,
            "title": "2创建带有参数的函数",
            "slug": "_2创建带有参数的函数",
            "link": "#_2创建带有参数的函数",
            "children": []
          },
          {
            "level": 3,
            "title": "3创建带有返回值的函数",
            "slug": "_3创建带有返回值的函数",
            "link": "#_3创建带有返回值的函数",
            "children": []
          },
          {
            "level": 3,
            "title": "4return和break",
            "slug": "_4return和break",
            "link": "#_4return和break",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "变量的作用域",
        "slug": "变量的作用域",
        "link": "#变量的作用域",
        "children": []
      },
      {
        "level": 2,
        "title": "函数作用域",
        "slug": "函数作用域",
        "link": "#函数作用域",
        "children": []
      },
      {
        "level": 2,
        "title": "匿名函数",
        "slug": "匿名函数",
        "link": "#匿名函数",
        "children": [
          {
            "level": 3,
            "title": "1创建函数",
            "slug": "_1创建函数",
            "link": "#_1创建函数",
            "children": []
          },
          {
            "level": 3,
            "title": "2函数名称 和 函数名称()",
            "slug": "_2函数名称-和-函数名称",
            "link": "#_2函数名称-和-函数名称",
            "children": []
          },
          {
            "level": 3,
            "title": "3对比函数声明与函数表达式的区别",
            "slug": "_3对比函数声明与函数表达式的区别",
            "link": "#_3对比函数声明与函数表达式的区别",
            "children": []
          },
          {
            "level": 3,
            "title": "4函数名与变量名相同时的提升情况",
            "slug": "_4函数名与变量名相同时的提升情况",
            "link": "#_4函数名与变量名相同时的提升情况",
            "children": []
          },
          {
            "level": 3,
            "title": "5全局污染与解决方案",
            "slug": "_5全局污染与解决方案",
            "link": "#_5全局污染与解决方案",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "回调函数",
        "slug": "回调函数",
        "link": "#回调函数",
        "children": []
      },
      {
        "level": 2,
        "title": "递归recursion",
        "slug": "递归recursion",
        "link": "#递归recursion",
        "children": []
      },
      {
        "level": 2,
        "title": "对象",
        "slug": "对象",
        "link": "#对象",
        "children": [
          {
            "level": 3,
            "title": "1.JS中的对象",
            "slug": "_1-js中的对象",
            "link": "#_1-js中的对象",
            "children": []
          },
          {
            "level": 3,
            "title": "2.自定义对象",
            "slug": "_2-自定义对象",
            "link": "#_2-自定义对象",
            "children": []
          },
          {
            "level": 3,
            "title": "3.属性的访问",
            "slug": "_3-属性的访问",
            "link": "#_3-属性的访问",
            "children": []
          },
          {
            "level": 3,
            "title": "4.遍历(枚举)属性",
            "slug": "_4-遍历-枚举-属性",
            "link": "#_4-遍历-枚举-属性",
            "children": []
          },
          {
            "level": 3,
            "title": "5.检测属性是否存在",
            "slug": "_5-检测属性是否存在",
            "link": "#_5-检测属性是否存在",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "模板字符串",
        "slug": "模板字符串",
        "link": "#模板字符串",
        "children": []
      },
      {
        "level": 2,
        "title": "对象中的方法",
        "slug": "对象中的方法",
        "link": "#对象中的方法",
        "children": []
      },
      {
        "level": 2,
        "title": "数组",
        "slug": "数组",
        "link": "#数组",
        "children": [
          {
            "level": 3,
            "title": "1.创建数组",
            "slug": "_1-创建数组",
            "link": "#_1-创建数组",
            "children": []
          },
          {
            "level": 3,
            "title": "2.访问数组元素",
            "slug": "_2-访问数组元素",
            "link": "#_2-访问数组元素",
            "children": []
          },
          {
            "level": 3,
            "title": "3.数组的长度",
            "slug": "_3-数组的长度",
            "link": "#_3-数组的长度",
            "children": []
          },
          {
            "level": 3,
            "title": "4.数组分类",
            "slug": "_4-数组分类",
            "link": "#_4-数组分类",
            "children": []
          },
          {
            "level": 3,
            "title": "5.遍历数组元素",
            "slug": "_5-遍历数组元素",
            "link": "#_5-遍历数组元素",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "数组",
        "slug": "数组-1",
        "link": "#数组-1",
        "children": [
          {
            "level": 3,
            "title": "1.API",
            "slug": "_1-api",
            "link": "#_1-api",
            "children": []
          },
          {
            "level": 3,
            "title": "2.二维数组",
            "slug": "_2-二维数组",
            "link": "#_2-二维数组",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "字符串对象",
        "slug": "字符串对象",
        "link": "#字符串对象",
        "children": [
          {
            "level": 3,
            "title": "1.转义字符  ——  \\",
            "slug": "_1-转义字符-——",
            "link": "#_1-转义字符-——",
            "children": []
          },
          {
            "level": 3,
            "title": "2.API",
            "slug": "_2-api",
            "link": "#_2-api",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "Math对象",
        "slug": "math对象",
        "link": "#math对象",
        "children": []
      },
      {
        "level": 2,
        "title": "Date对象",
        "slug": "date对象",
        "link": "#date对象",
        "children": [
          {
            "level": 3,
            "title": "创建Date对象",
            "slug": "创建date对象",
            "link": "#创建date对象",
            "children": []
          },
          {
            "level": 3,
            "title": "Date对象转为本地字符串",
            "slug": "date对象转为本地字符串",
            "link": "#date对象转为本地字符串",
            "children": []
          },
          {
            "level": 3,
            "title": "获取Date对象存储的值",
            "slug": "获取date对象存储的值",
            "link": "#获取date对象存储的值",
            "children": []
          },
          {
            "level": 3,
            "title": "设置存储的值",
            "slug": "设置存储的值",
            "link": "#设置存储的值",
            "children": []
          },
          {
            "level": 3,
            "title": "拷贝一个Date对象",
            "slug": "拷贝一个date对象",
            "link": "#拷贝一个date对象",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "二、数字对象",
        "slug": "二、数字对象",
        "link": "#二、数字对象",
        "children": []
      },
      {
        "level": 2,
        "title": "三、布尔对象",
        "slug": "三、布尔对象",
        "link": "#三、布尔对象",
        "children": []
      },
      {
        "level": 2,
        "title": "四、错误处理",
        "slug": "四、错误处理",
        "link": "#四、错误处理",
        "children": [
          {
            "level": 3,
            "title": "常见的错误",
            "slug": "常见的错误",
            "link": "#常见的错误",
            "children": []
          },
          {
            "level": 3,
            "title": "错误处理",
            "slug": "错误处理",
            "link": "#错误处理",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "一、ES6",
        "slug": "一、es6",
        "link": "#一、es6",
        "children": [
          {
            "level": 3,
            "title": "1. 块级作用域",
            "slug": "_1-块级作用域",
            "link": "#_1-块级作用域",
            "children": []
          },
          {
            "level": 3,
            "title": "2. 参数增强",
            "slug": "_2-参数增强",
            "link": "#_2-参数增强",
            "children": []
          },
          {
            "level": 3,
            "title": "3. 箭头函数",
            "slug": "_3-箭头函数",
            "link": "#_3-箭头函数",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "二、Node.js概述",
        "slug": "二、node-js概述",
        "link": "#二、node-js概述",
        "children": [
          {
            "level": 3,
            "title": "Node.js对比JS",
            "slug": "node-js对比js",
            "link": "#node-js对比js",
            "children": []
          },
          {
            "level": 3,
            "title": "Node.js运行方式",
            "slug": "node-js运行方式",
            "link": "#node-js运行方式",
            "children": []
          },
          {
            "level": 3,
            "title": "Node.js特点",
            "slug": "node-js特点",
            "link": "#node-js特点",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "三、全局对象",
        "slug": "三、全局对象",
        "link": "#三、全局对象",
        "children": [
          {
            "level": 3,
            "title": "global对象",
            "slug": "global对象",
            "link": "#global对象",
            "children": []
          },
          {
            "level": 3,
            "title": "console对象",
            "slug": "console对象",
            "link": "#console对象",
            "children": []
          },
          {
            "level": 3,
            "title": "process对象",
            "slug": "process对象",
            "link": "#process对象",
            "children": []
          },
          {
            "level": 3,
            "title": "Buffer对象",
            "slug": "buffer对象",
            "link": "#buffer对象",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "四、模块",
        "slug": "四、模块",
        "link": "#四、模块",
        "children": [
          {
            "level": 3,
            "title": "局部变量",
            "slug": "局部变量",
            "link": "#局部变量",
            "children": []
          },
          {
            "level": 3,
            "title": "模块分类",
            "slug": "模块分类",
            "link": "#模块分类",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "二、包和NPM",
        "slug": "二、包和npm",
        "link": "#二、包和npm",
        "children": [
          {
            "level": 3,
            "title": "NPM命令",
            "slug": "npm命令",
            "link": "#npm命令",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "三、URL",
        "slug": "三、url",
        "link": "#三、url",
        "children": []
      },
      {
        "level": 2,
        "title": "四、定时器",
        "slug": "四、定时器",
        "link": "#四、定时器",
        "children": [
          {
            "level": 3,
            "title": "一次性定时器",
            "slug": "一次性定时器",
            "link": "#一次性定时器",
            "children": []
          },
          {
            "level": 3,
            "title": "周期性定时器",
            "slug": "周期性定时器",
            "link": "#周期性定时器",
            "children": []
          },
          {
            "level": 3,
            "title": "立即执行定时器",
            "slug": "立即执行定时器",
            "link": "#立即执行定时器",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "一、文件系统模块",
        "slug": "一、文件系统模块",
        "link": "#一、文件系统模块",
        "children": [
          {
            "level": 3,
            "title": "同步方法和异步方法",
            "slug": "同步方法和异步方法",
            "link": "#同步方法和异步方法",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "二、HTTP协议",
        "slug": "二、http协议",
        "link": "#二、http协议",
        "children": [
          {
            "level": 3,
            "title": "1.通用头信息",
            "slug": "_1-通用头信息",
            "link": "#_1-通用头信息",
            "children": []
          },
          {
            "level": 3,
            "title": "2.响应头信息",
            "slug": "_2-响应头信息",
            "link": "#_2-响应头信息",
            "children": []
          },
          {
            "level": 3,
            "title": "3.请求头信息",
            "slug": "_3-请求头信息",
            "link": "#_3-请求头信息",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "三、HTTP模块",
        "slug": "三、http模块",
        "link": "#三、http模块",
        "children": []
      },
      {
        "level": 2,
        "title": "一、http模块",
        "slug": "一、http模块",
        "link": "#一、http模块",
        "children": []
      },
      {
        "level": 2,
        "title": "二、express框架",
        "slug": "二、express框架",
        "link": "#二、express框架",
        "children": [
          {
            "level": 3,
            "title": "创建WEB服务器",
            "slug": "创建web服务器",
            "link": "#创建web服务器",
            "children": []
          },
          {
            "level": 3,
            "title": "路由",
            "slug": "路由",
            "link": "#路由",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "一、路由器",
        "slug": "一、路由器",
        "link": "#一、路由器",
        "children": [
          {
            "level": 3,
            "title": "路由器模块",
            "slug": "路由器模块",
            "link": "#路由器模块",
            "children": []
          },
          {
            "level": 3,
            "title": "WEB服务器",
            "slug": "web服务器",
            "link": "#web服务器",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "二、中间件(插件)",
        "slug": "二、中间件-插件",
        "link": "#二、中间件-插件",
        "children": [
          {
            "level": 3,
            "title": "1.应用级中间件",
            "slug": "_1-应用级中间件",
            "link": "#_1-应用级中间件",
            "children": []
          },
          {
            "level": 3,
            "title": "2.路由级中间件",
            "slug": "_2-路由级中间件",
            "link": "#_2-路由级中间件",
            "children": []
          },
          {
            "level": 3,
            "title": "3.内置中间件",
            "slug": "_3-内置中间件",
            "link": "#_3-内置中间件",
            "children": []
          },
          {
            "level": 3,
            "title": "4.第三方中间件",
            "slug": "_4-第三方中间件",
            "link": "#_4-第三方中间件",
            "children": []
          },
          {
            "level": 3,
            "title": "5.错误处理中间件",
            "slug": "_5-错误处理中间件",
            "link": "#_5-错误处理中间件",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "一、使用express项目生成器搭建项目(脚手架)",
        "slug": "一、使用express项目生成器搭建项目-脚手架",
        "link": "#一、使用express项目生成器搭建项目-脚手架",
        "children": [
          {
            "level": 3,
            "title": "生成项目",
            "slug": "生成项目",
            "link": "#生成项目",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "二、pm2",
        "slug": "二、pm2",
        "link": "#二、pm2",
        "children": [
          {
            "level": 3,
            "title": "1.特征：",
            "slug": "_1-特征",
            "link": "#_1-特征",
            "children": []
          },
          {
            "level": 3,
            "title": "2.安装",
            "slug": "_2-安装",
            "link": "#_2-安装",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "AJAX(阿贾克斯)",
        "slug": "ajax-阿贾克斯",
        "link": "#ajax-阿贾克斯",
        "children": []
      },
      {
        "level": 2,
        "title": "一、跨域",
        "slug": "一、跨域",
        "link": "#一、跨域",
        "children": []
      },
      {
        "level": 2,
        "title": "二、AJAX请求步骤",
        "slug": "二、ajax请求步骤",
        "link": "#二、ajax请求步骤",
        "children": []
      },
      {
        "level": 2,
        "title": "三、post传参的内容类型",
        "slug": "三、post传参的内容类型",
        "link": "#三、post传参的内容类型",
        "children": [
          {
            "level": 3,
            "title": "AJAX中POST传参",
            "slug": "ajax中post传参",
            "link": "#ajax中post传参",
            "children": []
          },
          {
            "level": 3,
            "title": "express中将post传参格式为json数据转为对象",
            "slug": "express中将post传参格式为json数据转为对象",
            "link": "#express中将post传参格式为json数据转为对象",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "JSON",
        "slug": "json",
        "link": "#json",
        "children": []
      },
      {
        "level": 2,
        "title": "一.正则表达式",
        "slug": "一-正则表达式",
        "link": "#一-正则表达式",
        "children": [
          {
            "level": 3,
            "title": "1.字符集",
            "slug": "_1-字符集",
            "link": "#_1-字符集",
            "children": []
          },
          {
            "level": 3,
            "title": "2.预定义字符集",
            "slug": "_2-预定义字符集",
            "link": "#_2-预定义字符集",
            "children": []
          },
          {
            "level": 3,
            "title": "3.量词",
            "slug": "_3-量词",
            "link": "#_3-量词",
            "children": []
          },
          {
            "level": 3,
            "title": "4.匹配特殊位置",
            "slug": "_4-匹配特殊位置",
            "link": "#_4-匹配特殊位置",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "全局作用域",
        "slug": "全局作用域",
        "link": "#全局作用域",
        "children": []
      },
      {
        "level": 2,
        "title": "window对象",
        "slug": "window对象",
        "link": "#window对象",
        "children": []
      },
      {
        "level": 2,
        "title": "函数作用域",
        "slug": "函数作用域-1",
        "link": "#函数作用域-1",
        "children": []
      },
      {
        "level": 2,
        "title": "作用域链",
        "slug": "作用域链",
        "link": "#作用域链",
        "children": []
      },
      {
        "level": 2,
        "title": "闭包",
        "slug": "闭包",
        "link": "#闭包",
        "children": []
      },
      {
        "level": 2,
        "title": "私有变量",
        "slug": "私有变量",
        "link": "#私有变量",
        "children": []
      },
      {
        "level": 2,
        "title": "上午知识点回顾",
        "slug": "上午知识点回顾",
        "link": "#上午知识点回顾",
        "children": []
      },
      {
        "level": 2,
        "title": "arguments",
        "slug": "arguments",
        "link": "#arguments",
        "children": []
      },
      {
        "level": 2,
        "title": "函数重载",
        "slug": "函数重载",
        "link": "#函数重载",
        "children": []
      },
      {
        "level": 2,
        "title": "练习",
        "slug": "练习",
        "link": "#练习",
        "children": []
      },
      {
        "level": 2,
        "title": "this",
        "slug": "this",
        "link": "#this",
        "children": []
      },
      {
        "level": 2,
        "title": "call",
        "slug": "call",
        "link": "#call",
        "children": []
      },
      {
        "level": 2,
        "title": "call的实参",
        "slug": "call的实参",
        "link": "#call的实参",
        "children": []
      },
      {
        "level": 2,
        "title": "内容总结",
        "slug": "内容总结",
        "link": "#内容总结",
        "children": []
      },
      {
        "level": 2,
        "title": "apply",
        "slug": "apply",
        "link": "#apply",
        "children": []
      },
      {
        "level": 2,
        "title": "bind",
        "slug": "bind",
        "link": "#bind",
        "children": []
      },
      {
        "level": 2,
        "title": "构造函数",
        "slug": "构造函数",
        "link": "#构造函数",
        "children": []
      },
      {
        "level": 2,
        "title": "new",
        "slug": "new",
        "link": "#new",
        "children": []
      },
      {
        "level": 2,
        "title": "prototype",
        "slug": "prototype",
        "link": "#prototype",
        "children": []
      },
      {
        "level": 2,
        "title": "数组的原型",
        "slug": "数组的原型",
        "link": "#数组的原型",
        "children": []
      },
      {
        "level": 2,
        "title": "class语法",
        "slug": "class语法",
        "link": "#class语法",
        "children": []
      },
      {
        "level": 2,
        "title": "严格模式",
        "slug": "严格模式",
        "link": "#严格模式",
        "children": []
      },
      {
        "level": 2,
        "title": "ES6",
        "slug": "es6",
        "link": "#es6",
        "children": []
      },
      {
        "level": 2,
        "title": "let与const",
        "slug": "let与const",
        "link": "#let与const",
        "children": []
      },
      {
        "level": 2,
        "title": "块级",
        "slug": "块级",
        "link": "#块级",
        "children": []
      },
      {
        "level": 2,
        "title": "声明提升",
        "slug": "声明提升",
        "link": "#声明提升",
        "children": []
      },
      {
        "level": 2,
        "title": "总结",
        "slug": "总结",
        "link": "#总结",
        "children": []
      },
      {
        "level": 2,
        "title": "回顾",
        "slug": "回顾",
        "link": "#回顾",
        "children": []
      },
      {
        "level": 2,
        "title": "模板字符串",
        "slug": "模板字符串-1",
        "link": "#模板字符串-1",
        "children": []
      },
      {
        "level": 2,
        "title": "箭头函数",
        "slug": "箭头函数",
        "link": "#箭头函数",
        "children": []
      },
      {
        "level": 2,
        "title": "箭头函数的this",
        "slug": "箭头函数的this",
        "link": "#箭头函数的this",
        "children": []
      },
      {
        "level": 2,
        "title": "数组的高阶函数",
        "slug": "数组的高阶函数",
        "link": "#数组的高阶函数",
        "children": []
      },
      {
        "level": 2,
        "title": "every",
        "slug": "every",
        "link": "#every",
        "children": []
      },
      {
        "level": 2,
        "title": "some",
        "slug": "some",
        "link": "#some",
        "children": []
      },
      {
        "level": 2,
        "title": "filter",
        "slug": "filter",
        "link": "#filter",
        "children": []
      },
      {
        "level": 2,
        "title": "map",
        "slug": "map",
        "link": "#map",
        "children": []
      },
      {
        "level": 2,
        "title": "ajax",
        "slug": "ajax",
        "link": "#ajax",
        "children": []
      },
      {
        "level": 2,
        "title": "ajax封装",
        "slug": "ajax封装",
        "link": "#ajax封装",
        "children": []
      },
      {
        "level": 2,
        "title": "练习",
        "slug": "练习-1",
        "link": "#练习-1",
        "children": []
      },
      {
        "level": 2,
        "title": "总结",
        "slug": "总结-1",
        "link": "#总结-1",
        "children": []
      },
      {
        "level": 2,
        "title": "回顾",
        "slug": "回顾-1",
        "link": "#回顾-1",
        "children": []
      },
      {
        "level": 2,
        "title": "forEach",
        "slug": "foreach",
        "link": "#foreach",
        "children": []
      },
      {
        "level": 2,
        "title": "reduce",
        "slug": "reduce",
        "link": "#reduce",
        "children": []
      },
      {
        "level": 2,
        "title": "数组数据转HTML代码的方案",
        "slug": "数组数据转html代码的方案",
        "link": "#数组数据转html代码的方案",
        "children": []
      },
      {
        "level": 2,
        "title": "展开语法",
        "slug": "展开语法",
        "link": "#展开语法",
        "children": []
      },
      {
        "level": 2,
        "title": "剩余参数",
        "slug": "剩余参数",
        "link": "#剩余参数",
        "children": []
      },
      {
        "level": 2,
        "title": "解构语法",
        "slug": "解构语法",
        "link": "#解构语法",
        "children": []
      },
      {
        "level": 2,
        "title": "复杂解构",
        "slug": "复杂解构",
        "link": "#复杂解构",
        "children": []
      },
      {
        "level": 2,
        "title": "形参解构",
        "slug": "形参解构",
        "link": "#形参解构",
        "children": []
      },
      {
        "level": 2,
        "title": "dom操作初体验",
        "slug": "dom操作初体验",
        "link": "#dom操作初体验",
        "children": []
      },
      {
        "level": 2,
        "title": "事件",
        "slug": "事件",
        "link": "#事件",
        "children": []
      },
      {
        "level": 2,
        "title": "style操作",
        "slug": "style操作",
        "link": "#style操作",
        "children": []
      },
      {
        "level": 2,
        "title": "querySelectorAll",
        "slug": "queryselectorall",
        "link": "#queryselectorall",
        "children": []
      },
      {
        "level": 2,
        "title": "class",
        "slug": "class",
        "link": "#class",
        "children": []
      },
      {
        "level": 2,
        "title": "开关",
        "slug": "开关",
        "link": "#开关",
        "children": []
      },
      {
        "level": 2,
        "title": "唯一性激活效果",
        "slug": "唯一性激活效果",
        "link": "#唯一性激活效果",
        "children": []
      },
      {
        "level": 2,
        "title": "广告弹窗",
        "slug": "广告弹窗",
        "link": "#广告弹窗",
        "children": []
      },
      {
        "level": 2,
        "title": "回顾",
        "slug": "回顾-2",
        "link": "#回顾-2",
        "children": []
      },
      {
        "level": 2,
        "title": "属性操作",
        "slug": "属性操作",
        "link": "#属性操作",
        "children": []
      },
      {
        "level": 2,
        "title": "练习",
        "slug": "练习-2",
        "link": "#练习-2",
        "children": []
      },
      {
        "level": 2,
        "title": "练习",
        "slug": "练习-3",
        "link": "#练习-3",
        "children": []
      },
      {
        "level": 2,
        "title": "练习",
        "slug": "练习-4",
        "link": "#练习-4",
        "children": []
      },
      {
        "level": 2,
        "title": "练习",
        "slug": "练习-5",
        "link": "#练习-5",
        "children": []
      },
      {
        "level": 2,
        "title": "标签栏切换",
        "slug": "标签栏切换",
        "link": "#标签栏切换",
        "children": []
      },
      {
        "level": 2,
        "title": "轮播图",
        "slug": "轮播图",
        "link": "#轮播图",
        "children": []
      },
      {
        "level": 2,
        "title": "内容",
        "slug": "内容",
        "link": "#内容",
        "children": []
      },
      {
        "level": 2,
        "title": "计数器",
        "slug": "计数器",
        "link": "#计数器",
        "children": []
      },
      {
        "level": 2,
        "title": "购物车",
        "slug": "购物车",
        "link": "#购物车",
        "children": []
      },
      {
        "level": 2,
        "title": "知识点总结",
        "slug": "知识点总结",
        "link": "#知识点总结",
        "children": []
      },
      {
        "level": 2,
        "title": "购物车",
        "slug": "购物车-1",
        "link": "#购物车-1",
        "children": []
      },
      {
        "level": 2,
        "title": "表单元素事件",
        "slug": "表单元素事件",
        "link": "#表单元素事件",
        "children": []
      },
      {
        "level": 2,
        "title": "练习: 输入框内容格式验证",
        "slug": "练习-输入框内容格式验证",
        "link": "#练习-输入框内容格式验证",
        "children": []
      },
      {
        "level": 2,
        "title": "练习: 实时搜索",
        "slug": "练习-实时搜索",
        "link": "#练习-实时搜索",
        "children": []
      },
      {
        "level": 2,
        "title": "勾选框联动",
        "slug": "勾选框联动",
        "link": "#勾选框联动",
        "children": []
      },
      {
        "level": 2,
        "title": "滑块: 颜色选择",
        "slug": "滑块-颜色选择",
        "link": "#滑块-颜色选择",
        "children": []
      },
      {
        "level": 2,
        "title": "事件的冒泡机制",
        "slug": "事件的冒泡机制",
        "link": "#事件的冒泡机制",
        "children": []
      },
      {
        "level": 2,
        "title": "委托模式",
        "slug": "委托模式",
        "link": "#委托模式",
        "children": []
      },
      {
        "level": 2,
        "title": "练习: 动态新增子元素",
        "slug": "练习-动态新增子元素",
        "link": "#练习-动态新增子元素",
        "children": []
      },
      {
        "level": 2,
        "title": "练习: 网络请求+委托",
        "slug": "练习-网络请求-委托",
        "link": "#练习-网络请求-委托",
        "children": []
      },
      {
        "level": 2,
        "title": "事件监听器",
        "slug": "事件监听器",
        "link": "#事件监听器",
        "children": []
      },
      {
        "level": 2,
        "title": "页面的滚动事件",
        "slug": "页面的滚动事件",
        "link": "#页面的滚动事件",
        "children": []
      },
      {
        "level": 2,
        "title": "createDOM",
        "slug": "createdom",
        "link": "#createdom",
        "children": []
      },
      {
        "level": 2,
        "title": "封装技巧",
        "slug": "封装技巧",
        "link": "#封装技巧",
        "children": []
      },
      {
        "level": 2,
        "title": "jQuery",
        "slug": "jquery",
        "link": "#jquery",
        "children": []
      },
      {
        "level": 2,
        "title": "css方法",
        "slug": "css方法",
        "link": "#css方法",
        "children": []
      },
      {
        "level": 2,
        "title": "事件",
        "slug": "事件-1",
        "link": "#事件-1",
        "children": []
      },
      {
        "level": 2,
        "title": "class操作",
        "slug": "class操作",
        "link": "#class操作",
        "children": []
      },
      {
        "level": 2,
        "title": "练习: 选中效果",
        "slug": "练习-选中效果",
        "link": "#练习-选中效果",
        "children": []
      },
      {
        "level": 2,
        "title": "练习:单选效果",
        "slug": "练习-单选效果",
        "link": "#练习-单选效果",
        "children": []
      },
      {
        "level": 2,
        "title": "显示和隐藏",
        "slug": "显示和隐藏",
        "link": "#显示和隐藏",
        "children": []
      },
      {
        "level": 2,
        "title": "练习:菜单展开",
        "slug": "练习-菜单展开",
        "link": "#练习-菜单展开",
        "children": []
      },
      {
        "level": 2,
        "title": "练习:底部弹窗",
        "slug": "练习-底部弹窗",
        "link": "#练习-底部弹窗",
        "children": []
      },
      {
        "level": 2,
        "title": "自定义动画",
        "slug": "自定义动画",
        "link": "#自定义动画",
        "children": []
      },
      {
        "level": 2,
        "title": "练习: 标签栏切换",
        "slug": "练习-标签栏切换",
        "link": "#练习-标签栏切换",
        "children": []
      },
      {
        "level": 2,
        "title": "属性操作",
        "slug": "属性操作-1",
        "link": "#属性操作-1",
        "children": []
      },
      {
        "level": 2,
        "title": "标签内容",
        "slug": "标签内容",
        "link": "#标签内容",
        "children": []
      },
      {
        "level": 2,
        "title": "get请求",
        "slug": "get请求",
        "link": "#get请求",
        "children": []
      },
      {
        "level": 2,
        "title": "总结",
        "slug": "总结-2",
        "link": "#总结-2",
        "children": []
      },
      {
        "level": 2,
        "title": "新增子元素",
        "slug": "新增子元素",
        "link": "#新增子元素",
        "children": []
      },
      {
        "level": 2,
        "title": "委托",
        "slug": "委托",
        "link": "#委托",
        "children": []
      },
      {
        "level": 2,
        "title": "在元素上保存数据 data",
        "slug": "在元素上保存数据-data",
        "link": "#在元素上保存数据-data",
        "children": []
      },
      {
        "level": 2,
        "title": "练习: 加载更多",
        "slug": "练习-加载更多",
        "link": "#练习-加载更多",
        "children": []
      },
      {
        "level": 2,
        "title": "Node.js",
        "slug": "node-js",
        "link": "#node-js",
        "children": []
      },
      {
        "level": 2,
        "title": "把项目包使用 node.js 管理",
        "slug": "把项目包使用-node-js-管理",
        "link": "#把项目包使用-node-js-管理",
        "children": []
      },
      {
        "level": 2,
        "title": "外部js文件: 准备就绪",
        "slug": "外部js文件-准备就绪",
        "link": "#外部js文件-准备就绪",
        "children": []
      },
      {
        "level": 2,
        "title": "load :加载外部html",
        "slug": "load-加载外部html",
        "link": "#load-加载外部html",
        "children": []
      },
      {
        "level": 2,
        "title": "BOM",
        "slug": "bom",
        "link": "#bom",
        "children": [
          {
            "level": 3,
            "title": "location",
            "slug": "location",
            "link": "#location",
            "children": []
          },
          {
            "level": 3,
            "title": "刷新保持输入框内容",
            "slug": "刷新保持输入框内容",
            "link": "#刷新保持输入框内容",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "全局css变量",
        "slug": "全局css变量",
        "link": "#全局css变量",
        "children": []
      },
      {
        "level": 2,
        "title": "Webpack",
        "slug": "webpack",
        "link": "#webpack",
        "children": [
          {
            "level": 3,
            "title": "传统开发的问题",
            "slug": "传统开发的问题",
            "link": "#传统开发的问题",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "总结",
        "slug": "总结-3",
        "link": "#总结-3",
        "children": []
      },
      {
        "level": 2,
        "title": "面向对象 OOP",
        "slug": "面向对象-oop",
        "link": "#面向对象-oop",
        "children": [
          {
            "level": 3,
            "title": "封装",
            "slug": "封装",
            "link": "#封装",
            "children": []
          },
          {
            "level": 3,
            "title": "继承",
            "slug": "继承",
            "link": "#继承",
            "children": []
          },
          {
            "level": 3,
            "title": "多态",
            "slug": "多态",
            "link": "#多态",
            "children": []
          },
          {
            "level": 3,
            "title": "继承 function",
            "slug": "继承-function",
            "link": "#继承-function",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "对象的访问权限",
        "slug": "对象的访问权限",
        "link": "#对象的访问权限",
        "children": []
      }
    ],
    "path": "/WEB/JS.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "React",
    "headers": [],
    "path": "/WEB/react.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Uniapp",
    "headers": [],
    "path": "/WEB/uniapp.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Vue",
    "headers": [],
    "path": "/WEB/vue.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "年度总结",
    "headers": [
      {
        "level": 2,
        "title": "2024",
        "slug": "_2024",
        "link": "#_2024",
        "children": []
      }
    ],
    "path": "/YEAR/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "C",
    "headers": [],
    "path": "/Api/C/c.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "C++",
    "headers": [],
    "path": "/Api/C__/c__.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Go",
    "headers": [],
    "path": "/Api/Go/go.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "JAVA",
    "headers": [],
    "path": "/Api/Java/java.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Nginx",
    "headers": [],
    "path": "/Api/Nginx/nginx.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "NodeJS",
    "headers": [
      {
        "level": 2,
        "title": "1.node介绍与使用",
        "slug": "_1-node介绍与使用",
        "link": "#_1-node介绍与使用",
        "children": [
          {
            "level": 3,
            "title": "1.1 Node介绍",
            "slug": "_1-1-node介绍",
            "link": "#_1-1-node介绍",
            "children": []
          },
          {
            "level": 3,
            "title": "1.2 node.js的优势",
            "slug": "_1-2-node-js的优势",
            "link": "#_1-2-node-js的优势",
            "children": []
          }
        ]
      }
    ],
    "path": "/Api/NodeJS/nodejs.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Python",
    "headers": [],
    "path": "/Api/Python/Python.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "",
    "headers": [],
    "path": "/404.html",
    "pathLocale": "/",
    "extraFields": []
  }
]
